<script setup>
    const wrapper = ref({
        img: '/dogs/poster.png',
        title: 'Питомцы приюта Хаёт',
        info: 'Сейчас в приюте 6000+ собак. Собак привозят из Ташкента и Ташобласти'
    })

    const info = ref({
        text: `<p>Основную массу собак службы отлова Ташкента и близлежащих городов привезли в приют с согласия руководителя приюта Хаёт Ироды Маткаримовой. Альтернативой могла стать ликвидация. Часть собачек спасли от жестокости человека, кого-то сдали в приют хозяева, третьих сбила машина. Все они нуждаются в надежных и любящих домах, где они смогут заново построить свою жизнь и обрести счастье. </p> <br/>
        
        <p> <b> Все упсыновления проводятся строго лично в приюте «Хаёт». </b> Мы не доставляем собак. Для нас, для вас и для собаки очень важно, чтобы вы лично познакомились с вашим будущим новым членом семьи и выбрали друг друга. Это первый шаг к тому, чтобы обеспечить вам с собачкой долгую и счастливую совместную жизнь. </p> <br/>
        
        <p> <b>Это бесплатно.</b> Мы просим лишь взять на себя расходы на ветеринарный осмотр собаки, если взяли щенка — стерилизацию по достижении 6-месячного возраста. Если вы хотите упсыновить собачку или взять на воспитание, пожалуйста, заполните заявку ниже. Мы свяжемся с вами в течение 48 часов. </p>`,
        list: [
            {
                _id: 1,
                url: '/',
                title: 'Упсыновить собачку'
            },
            {
                _id: 2,
                url: '/',
                title: 'Взять на на воспитание'
            },
        ]
    })

    const list = ref({
        title: 'У нас 6000+ прекрасных собак и 16 осликов, которые ждут своего нового дома. Может, одна из них ваша?',
        filter: []
    })
</script>

<template>
        <div class="dogs body">
            <Wrapper
                :wrapper="wrapper"
            />
            <PageInfo 
                :info="info"
            />
            <DogsList
                :list="list"
            />
        </div>
</template>

<style>

</style>