<script setup>
    import cardHelp from './cards/cardHelp.vue';

    const items = ref([
        {
            id: 1,
            title: "Почему стерилизация и кастрация – это полезно",
            date: '12 апреля 2023',
            info: 'Если вы можете на время приютить животное самостоятельно. Если нет возможности держать собаку или кошку у себя дома, то нужно найти «передержку»',
            img: "/helpful/help1.jpg",
            slug: "help1",
        },
        {
            id: 2,
            title: "Почему стерилизация и кастрация – это полезно",
            date: '12 апреля 2023',
            info: 'Если вы можете на время приютить животное самостоятельно. Если нет возможности держать собаку или кошку у себя дома, то нужно найти «передержку»',
            img: "/helpful/help2.jpg",
            slug: "help2",
        },
        {
            id: 3,
            title: "Почему стерилизация и кастрация – это полезно",
            date: '12 апреля 2023',
            info: 'Если вы можете на время приютить животное самостоятельно. Если нет возможности держать собаку или кошку у себя дома, то нужно найти «передержку»',
            img: "/helpful/help3.jpg",
            slug: "help3",
        },
        {
            id: 4,
            title: "Почему стерилизация и кастрация – это полезно",
            date: '12 апреля 2023',
            info: 'Если вы можете на время приютить животное самостоятельно. Если нет возможности держать собаку или кошку у себя дома, то нужно найти «передержку»',
            img: "/helpful/help4.jpg",
            slug: "help4",
        },
        {
            id: 5,
            title: "Почему стерилизация и кастрация – это полезно",
            date: '12 апреля 2023',
            info: 'Если вы можете на время приютить животное самостоятельно. Если нет возможности держать собаку или кошку у себя дома, то нужно найти «передержку»',
            img: "/helpful/help5.jpg",
            slug: "help5",
        },
        {
            id: 6,
            title: "Почему стерилизация и кастрация – это полезно",
            date: '12 апреля 2023',
            info: 'Если вы можете на время приютить животное самостоятельно. Если нет возможности держать собаку или кошку у себя дома, то нужно найти «передержку»',
            img: "/helpful/help6.jpg",
            slug: "help6",
        },
        {
            id: 7,
            title: "Почему стерилизация и кастрация – это полезно",
            date: '12 апреля 2023',
            info: 'Если вы можете на время приютить животное самостоятельно. Если нет возможности держать собаку или кошку у себя дома, то нужно найти «передержку»',
            img: "/helpful/help7.jpg",
            slug: "help7",
        },
    ])
</script>   

<template>
    <div class="helpList">
        <div class="container">
            <div class="helpList__box">
                <div class="helpList__head">
                    <div class="helpList__title">Собака это отдельный мир, индивидуальное мышление, иное нежели наше, человеческое, миропонимание. Рассказываем об особенностях собак и как вести себя в новых незнакромых вам условиях и ситуациях</div>
                </div>
                <div class="helpList__body">
                    <div class="helpList__masonry">
                        <masonry-wall :items="items" :ssr-columns="1" :column-width="300" :gap="50">
                            <template #default="{ item }" >
                                <div class="list__item">
                                    <card-help
                                        :card="item"
                                    />
                                </div>
                            </template>
                        </masonry-wall>
                    </div>
                </div>
            </div>
        </div>
    </div>
</template>

<style lang="scss">
@import '@/assets/styles/components/helpList.scss';
</style>