<script setup>
    const list = ref([
        {
            title: 'Информационно',
            list: [
                {
                    title: 'вести соцсети приюта (см список соцсетей приюта). От 5 минут в день.'
                },
                {
                    title: 'писать истории собак (см копирайтеры Хаёт) от 3 часов в неделю.'
                },
                {
                    title: 'рассказывать о приюте всем и везде, где только можно в интернете и офлайн, на площадках бесплатных объявлений и в закрытых сообществах, в школе, на работе, в институте, на мероприятиях. (от 5 минут в день)'
                },
                {
                    title: 'рассылать письма блогерам с просьбой рассказать о Хаёте (от 15 минут в день). Напишите Данияру, у него все шаблоны, всё объяснит — t.me/dandesdet'
                },
                {
                    title: 'если вы разработчик, можно улучшить бота приюта или сделать новый сайт приюту / мобильное приложение.'
                },
                {
                    title: 'сверстать объявление о приюте или про закон о жестоком обращении, напечатать его и расклеивать в городе C печатью объявлений поможем.'
                },
            ]
        },
        {
            title: 'Физически',
            list: [
                {
                    title: 'вести соцсети приюта (см список соцсетей приюта). От 5 минут в день.'
                },
                {
                    title: 'писать истории собак (см копирайтеры Хаёт) от 3 часов в неделю.'
                },
                {
                    title: 'рассказывать о приюте всем и везде, где только можно в интернете и офлайн, на площадках бесплатных объявлений и в закрытых сообществах, в школе, на работе, в институте, на мероприятиях. (от 5 минут в день)'
                },
                {
                    title: 'рассылать письма блогерам с просьбой рассказать о Хаёте (от 15 минут в день). Напишите Данияру, у него все шаблоны, всё объяснит — t.me/dandesdet'
                },
                {
                    title: 'если вы разработчик, можно улучшить бота приюта или сделать новый сайт приюту / мобильное приложение.'
                },
                {
                    title: 'сверстать объявление о приюте или про закон о жестоком обращении, напечатать его и расклеивать в городе C печатью объявлений поможем.'
                },
            ]
        },
        {
            title: 'Материально',
            list: [
                {
                    title: 'вести соцсети приюта (см список соцсетей приюта). От 5 минут в день.'
                },
                {
                    title: 'писать истории собак (см копирайтеры Хаёт) от 3 часов в неделю.'
                },
                {
                    title: 'рассказывать о приюте всем и везде, где только можно в интернете и офлайн, на площадках бесплатных объявлений и в закрытых сообществах, в школе, на работе, в институте, на мероприятиях. (от 5 минут в день)'
                },
                {
                    title: 'рассылать письма блогерам с просьбой рассказать о Хаёте (от 15 минут в день). Напишите Данияру, у него все шаблоны, всё объяснит — t.me/dandesdet'
                },
                {
                    title: 'если вы разработчик, можно улучшить бота приюта или сделать новый сайт приюту / мобильное приложение.'
                },
                {
                    title: 'сверстать объявление о приюте или про закон о жестоком обращении, напечатать его и расклеивать в городе C печатью объявлений поможем.'
                },
            ]
        },
    ])
</script>

<template>
    <div class="volHelp">
        <div class="container">
            <div class="volHelp__box">
                <div class="volHelp__title">Как вы можете помогать приюту Хаёт</div>
                
                <ul class="volHelp__list">
                    <li class="item" v-for="item, index of list" :key="index">
                        <div class="item__title">{{ item?.title }}</div>

                        <ul class="item__list">
                            <li class="subItem" v-for="subItem, index of item?.list" :key="index">
                                <div class="subItem__text">— {{ subItem?.title }}</div>
                            </li>
                        </ul>
                    </li>
                </ul>

                <div class="volHelp__all">
                    <NuxtLink to="/">Открыть все задачи</NuxtLink>
                </div>
            </div>
        </div>
    </div>
</template>

<style lang="scss">
@import '@/assets/styles/components/volHelp.scss';
</style>